name: "mkl2017_resnet-152"
#--------------------
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_train_lmdb"
    batch_size: 32
    backend: LMDB
    prefetch: 2
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 50
    backend: LMDB
  }
}

layer {
        bottom: "data"
        top: "conv1"
        name: "conv1"
        type: "Convolution"
        convolution_param {
                 
                num_output: 64
                kernel_size: 7
                pad: 3
                stride: 2
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "conv1"
        top: "conv1"
        name: "bn_conv1"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                 
        }
}

layer {
        bottom: "conv1"
        top: "conv1"
        name: "conv1_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "conv1"
        top: "pool1"
        name: "pool1"
        type: "Pooling"
        pooling_param {
                 
                kernel_size: 3
                stride: 2
                pool: MAX
        }
}

layer {
        bottom: "pool1"
        top: "res2a_branch1"
        name: "res2a_branch1"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2a_branch1"
        top: "res2a_branch1"
        name: "bn2a_branch1"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                 
        }
}

layer {
        bottom: "pool1"
        top: "res2a_branch2a"
        name: "res2a_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 64
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2a_branch2a"
        top: "res2a_branch2a"
        name: "bn2a_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                 
        }
}

layer {
        bottom: "res2a_branch2a"
        top: "res2a_branch2a"
        name: "res2a_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2a_branch2a"
        top: "res2a_branch2b"
        name: "res2a_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 64
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2a_branch2b"
        top: "res2a_branch2b"
        name: "bn2a_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                 
        }
}

layer {
        bottom: "res2a_branch2b"
        top: "res2a_branch2b"
        name: "res2a_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2a_branch2b"
        top: "res2a_branch2c"
        name: "res2a_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2a_branch2c"
        top: "res2a_branch2c"
        name: "bn2a_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res2a_branch1"
        bottom: "res2a_branch2c"
        top: "res2a"
        name: "res2a"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res2a"
        top: "res2a"
        name: "res2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2a"
        top: "res2b_branch2a"
        name: "res2b_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 64
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2b_branch2a"
        top: "res2b_branch2a"
        name: "bn2b_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res2b_branch2a"
        top: "res2b_branch2a"
        name: "res2b_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2b_branch2a"
        top: "res2b_branch2b"
        name: "res2b_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 64
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2b_branch2b"
        top: "res2b_branch2b"
        name: "bn2b_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res2b_branch2b"
        top: "res2b_branch2b"
        name: "res2b_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2b_branch2b"
        top: "res2b_branch2c"
        name: "res2b_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2b_branch2c"
        top: "res2b_branch2c"
        name: "bn2b_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res2a"
        bottom: "res2b_branch2c"
        top: "res2b"
        name: "res2b"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res2b"
        top: "res2b"
        name: "res2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2b"
        top: "res2c_branch2a"
        name: "res2c_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 64
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2c_branch2a"
        top: "res2c_branch2a"
        name: "bn2c_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res2c_branch2a"
        top: "res2c_branch2a"
        name: "res2c_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2c_branch2a"
        top: "res2c_branch2b"
        name: "res2c_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 64
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2c_branch2b"
        top: "res2c_branch2b"
        name: "bn2c_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res2c_branch2b"
        top: "res2c_branch2b"
        name: "res2c_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2c_branch2b"
        top: "res2c_branch2c"
        name: "res2c_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res2c_branch2c"
        top: "res2c_branch2c"
        name: "bn2c_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res2b"
        bottom: "res2c_branch2c"
        top: "res2c"
        name: "res2c"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res2c"
        top: "res2c"
        name: "res2c_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res2c"
        top: "res3a_branch1"
        name: "res3a_branch1"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 2
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3a_branch1"
        top: "res3a_branch1"
        name: "bn3a_branch1"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res2c"
        top: "res3a_branch2a"
        name: "res3a_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 1
                pad: 0
                stride: 2
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3a_branch2a"
        top: "res3a_branch2a"
        name: "bn3a_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3a_branch2a"
        top: "res3a_branch2a"
        name: "res3a_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3a_branch2a"
        top: "res3a_branch2b"
        name: "res3a_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3a_branch2b"
        top: "res3a_branch2b"
        name: "bn3a_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3a_branch2b"
        top: "res3a_branch2b"
        name: "res3a_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3a_branch2b"
        top: "res3a_branch2c"
        name: "res3a_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3a_branch2c"
        top: "res3a_branch2c"
        name: "bn3a_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3a_branch1"
        bottom: "res3a_branch2c"
        top: "res3a"
        name: "res3a"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res3a"
        top: "res3a"
        name: "res3a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3a"
        top: "res3b_branch2a"
        name: "res3b_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3b_branch2a"
        top: "res3b_branch2a"
        name: "bn3b_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3b_branch2a"
        top: "res3b_branch2a"
        name: "res3b_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3b_branch2a"
        top: "res3b_branch2b"
        name: "res3b_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3b_branch2b"
        top: "res3b_branch2b"
        name: "bn3b_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3b_branch2b"
        top: "res3b_branch2b"
        name: "res3b_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3b_branch2b"
        top: "res3b_branch2c"
        name: "res3b_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3b_branch2c"
        top: "res3b_branch2c"
        name: "bn3b_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3a"
        bottom: "res3b_branch2c"
        top: "res3b"
        name: "res3b"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res3b"
        top: "res3b"
        name: "res3b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3b"
        top: "res3c_branch2a"
        name: "res3c_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3c_branch2a"
        top: "res3c_branch2a"
        name: "bn3c_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3c_branch2a"
        top: "res3c_branch2a"
        name: "res3c_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3c_branch2a"
        top: "res3c_branch2b"
        name: "res3c_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3c_branch2b"
        top: "res3c_branch2b"
        name: "bn3c_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3c_branch2b"
        top: "res3c_branch2b"
        name: "res3c_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3c_branch2b"
        top: "res3c_branch2c"
        name: "res3c_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3c_branch2c"
        top: "res3c_branch2c"
        name: "bn3c_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3b"
        bottom: "res3c_branch2c"
        top: "res3c"
        name: "res3c"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res3c"
        top: "res3c"
        name: "res3c_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3c"
        top: "res3d_branch2a"
        name: "res3d_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3d_branch2a"
        top: "res3d_branch2a"
        name: "bn3d_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3d_branch2a"
        top: "res3d_branch2a"
        name: "res3d_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3d_branch2a"
        top: "res3d_branch2b"
        name: "res3d_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3d_branch2b"
        top: "res3d_branch2b"
        name: "bn3d_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3d_branch2b"
        top: "res3d_branch2b"
        name: "res3d_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3d_branch2b"
        top: "res3d_branch2c"
        name: "res3d_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3d_branch2c"
        top: "res3d_branch2c"
        name: "bn3d_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3c"
        bottom: "res3d_branch2c"
        top: "res3d"
        name: "res3d"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res3d"
        top: "res3d"
        name: "res3d_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3d"
        top: "res3e_branch2a"
        name: "res3e_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3e_branch2a"
        top: "res3e_branch2a"
        name: "bn3e_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3e_branch2a"
        top: "res3e_branch2a"
        name: "res3e_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3e_branch2a"
        top: "res3e_branch2b"
        name: "res3e_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3e_branch2b"
        top: "res3e_branch2b"
        name: "bn3e_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3e_branch2b"
        top: "res3e_branch2b"
        name: "res3e_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3e_branch2b"
        top: "res3e_branch2c"
        name: "res3e_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3e_branch2c"
        top: "res3e_branch2c"
        name: "bn3e_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3d"
        bottom: "res3e_branch2c"
        top: "res3e"
        name: "res3e"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res3e"
        top: "res3e"
        name: "res3e_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3e"
        top: "res3f_branch2a"
        name: "res3f_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3f_branch2a"
        top: "res3f_branch2a"
        name: "bn3f_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3f_branch2a"
        top: "res3f_branch2a"
        name: "res3f_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3f_branch2a"
        top: "res3f_branch2b"
        name: "res3f_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3f_branch2b"
        top: "res3f_branch2b"
        name: "bn3f_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3f_branch2b"
        top: "res3f_branch2b"
        name: "res3f_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3f_branch2b"
        top: "res3f_branch2c"
        name: "res3f_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3f_branch2c"
        top: "res3f_branch2c"
        name: "bn3f_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3e"
        bottom: "res3f_branch2c"
        top: "res3f"
        name: "res3f"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res3f"
        top: "res3f"
        name: "res3f_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3f"
        top: "res3g_branch2a"
        name: "res3g_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3g_branch2a"
        top: "res3g_branch2a"
        name: "bn3g_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3g_branch2a"
        top: "res3g_branch2a"
        name: "res3g_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3g_branch2a"
        top: "res3g_branch2b"
        name: "res3g_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3g_branch2b"
        top: "res3g_branch2b"
        name: "bn3g_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3g_branch2b"
        top: "res3g_branch2b"
        name: "res3g_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3g_branch2b"
        top: "res3g_branch2c"
        name: "res3g_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3g_branch2c"
        top: "res3g_branch2c"
        name: "bn3g_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3f"
        bottom: "res3g_branch2c"
        top: "res3g"
        name: "res3g"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res3g"
        top: "res3g"
        name: "res3g_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3g"
        top: "res3h_branch2a"
        name: "res3h_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3h_branch2a"
        top: "res3h_branch2a"
        name: "bn3h_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3h_branch2a"
        top: "res3h_branch2a"
        name: "res3h_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3h_branch2a"
        top: "res3h_branch2b"
        name: "res3h_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 128
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3h_branch2b"
        top: "res3h_branch2b"
        name: "bn3h_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3h_branch2b"
        top: "res3h_branch2b"
        name: "res3h_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res3h_branch2b"
        top: "res3h_branch2c"
        name: "res3h_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 512
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res3h_branch2c"
        top: "res3h_branch2c"
        name: "bn3h_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3g"
        bottom: "res3h_branch2c"
        top: "res3h"
        name: "res3h"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res3h"
        top: "res3h"
        name: "res3h_relu"
        type: "ReLU"
        relu_param {
                 
        }
}


#---- conv4 ----

layer {
        bottom: "res3h"
        top: "res4a_branch1"
        name: "res4a_branch1"
        type: "Convolution"
        convolution_param {
                 
                num_output: 1024
                kernel_size: 1
                pad: 0
                stride: 2
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4a_branch1"
        top: "res4a_branch1"
        name: "bn4a_branch1"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res3h"
        top: "res4a_branch2a"
        name: "res4a_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 2
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4a_branch2a"
        top: "res4a_branch2a"
        name: "bn4a_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4a_branch2a"
        top: "res4a_branch2a"
        name: "res4a_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4a_branch2a"
        top: "res4a_branch2b"
        name: "res4a_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4a_branch2b"
        top: "res4a_branch2b"
        name: "bn4a_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4a_branch2b"
        top: "res4a_branch2b"
        name: "res4a_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4a_branch2b"
        top: "res4a_branch2c"
        name: "res4a_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 1024
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4a_branch2c"
        top: "res4a_branch2c"
        name: "bn4a_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4a_branch1"
        bottom: "res4a_branch2c"
        top: "res4a"
        name: "res4a"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res4a"
        top: "res4a"
        name: "res4a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4a"
        top: "res4b_branch2a"
        name: "res4b_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4b_branch2a"
        top: "res4b_branch2a"
        name: "bn4b_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4b_branch2a"
        top: "res4b_branch2a"
        name: "res4b_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4b_branch2a"
        top: "res4b_branch2b"
        name: "res4b_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4b_branch2b"
        top: "res4b_branch2b"
        name: "bn4b_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4b_branch2b"
        top: "res4b_branch2b"
        name: "res4b_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4b_branch2b"
        top: "res4b_branch2c"
        name: "res4b_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 1024
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4b_branch2c"
        top: "res4b_branch2c"
        name: "bn4b_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4a"
        bottom: "res4b_branch2c"
        top: "res4b"
        name: "res4b"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res4b"
        top: "res4b"
        name: "res4b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4b"
        top: "res4c_branch2a"
        name: "res4c_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4c_branch2a"
        top: "res4c_branch2a"
        name: "bn4c_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4c_branch2a"
        top: "res4c_branch2a"
        name: "res4c_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4c_branch2a"
        top: "res4c_branch2b"
        name: "res4c_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4c_branch2b"
        top: "res4c_branch2b"
        name: "bn4c_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4c_branch2b"
        top: "res4c_branch2b"
        name: "res4c_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4c_branch2b"
        top: "res4c_branch2c"
        name: "res4c_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 1024
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4c_branch2c"
        top: "res4c_branch2c"
        name: "bn4c_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4b"
        bottom: "res4c_branch2c"
        top: "res4c"
        name: "res4c"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res4c"
        top: "res4c"
        name: "res4c_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4c"
        top: "res4d_branch2a"
        name: "res4d_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4d_branch2a"
        top: "res4d_branch2a"
        name: "bn4d_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4d_branch2a"
        top: "res4d_branch2a"
        name: "res4d_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4d_branch2a"
        top: "res4d_branch2b"
        name: "res4d_branch2b"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 3
                pad: 1
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4d_branch2b"
        top: "res4d_branch2b"
        name: "bn4d_branch2b"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4d_branch2b"
        top: "res4d_branch2b"
        name: "res4d_branch2b_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4d_branch2b"
        top: "res4d_branch2c"
        name: "res4d_branch2c"
        type: "Convolution"
        convolution_param {
                 
                num_output: 1024
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4d_branch2c"
        top: "res4d_branch2c"
        name: "bn4d_branch2c"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4c"
        bottom: "res4d_branch2c"
        top: "res4d"
        name: "res4d"
        type: "Eltwise"
        eltwise_param {
                 
        }
}

layer {
        bottom: "res4d"
        top: "res4d"
        name: "res4d_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4d"
        top: "res4e_branch2a"
        name: "res4e_branch2a"
        type: "Convolution"
        convolution_param {
                 
                num_output: 256
                kernel_size: 1
                pad: 0
                stride: 1
                bias_term: false
                weight_filler {
                  type: "xavier"
                }
                bias_filler {
                  type: "constant"
                  value: 0.2
               }
        }
}

layer {
        bottom: "res4e_branch2a"
        top: "res4e_branch2a"
        name: "bn4e_branch2a"
        type: "BatchNorm"
        batch_norm_param {
                use_global_stats: false
                                 
        }
}

layer {
        bottom: "res4e_branch2a"
        top: "res4e_branch2a"
        name: "res4e_branch2a_relu"
        type: "ReLU"
        relu_param {
                 
        }
}

layer {
        bottom: "res4e_branch2a"
